---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.IESFileNotFoundWarning
source: html/39a15827-162e-40df-68e1-890669cf3258.htm
---
# Autodesk.Revit.DB.BuiltInFailures.IlluminationFailures.IESFileNotFoundWarning Property

Estimated Illumination failed. IES file not found for lighting fixture.

## Syntax (C#)
```csharp
public static FailureDefinitionId IESFileNotFoundWarning { get; }
```